jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
            // err_code = m_motion_configuration_apply((ble_tms_config_t *)p_data);
            // APP_ERROR_CHECK(err_code);
            break;

        default:
            break;
    }

}

ble_tms_t              m_tms;

static ble_tms_config_t     * m_config;

uint32_t usr_tms_init(void)
{
    uint32_t err_code;
    ble_tms_init_t        tms_init;

    memset(&tms_init, 0, sizeof(tms_init));

    // tms_init.p_init_config = m_config;
    tms_init.p_init_config->compass_interval_ms = 20;
    tms_init.p_init_config->motion_freq_hz = 50;
    tms_init.p_init_config->pedo_interval_ms = 1000;
    tms_init.p_init_config->temp_interval_ms = 1000;
    tms_init.p_init_config->wake_on_motion = 0;


    tms_init.evt_handler = ble_tms_evt_handler;

    NRF_LOG_INFO("motion_service_init: ble_tms_init \r\n");
    NRF_LOG_DEBUG("ble_tms_init");
    err_code = ble_tms_init(&m_tms, &tms_init);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("FAILED - %d\r\n", err_code);
        return err_code;
    }
}

void tms_test(void)
{
    // Test TMS data transmission
    ble_tms_quat_t data;
    data.w = 1;
    data.x = 2;
    data.y = 3;
    data.z = 4;
    (void)ble_tms_quat_set(&m_tms, &data);
    // NRF_LOG_INFO("TMS Send!");
}





BLE_BAS_DEF(m_bas);                                                 /**< Structure used to identify the battery service. */

uint32_t usr_bas_init(void)
{
    uint32_t err_code;
    ble_bas_init_t     bas_init;
    
    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    // Here the sec level for the Battery Service can be changed/increased.
    bas_init.bl_rd_sec        = SEC_OPEN;
    bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    bas_init.bl_report_rd_sec = SEC_OPEN;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);
}


void battery_level_update(uint8_t battery_level)
{
    ret_code_t err_code;

    err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}









/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


// Event handler DIY
/**@brief GPIOTE sceduled handler, executed in main-context.
 */
void imu_config_evt_sceduled(void * p_event_data, uint16_t event_size)
{
		// Enable sensor parameters based on received configuration
		uint32_t err_code;
		err_code =  imu_enable_sensors(imu);
		APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
		uint32_t err_code;
	
    switch (p_evt->type)
    {
		
			case BLE_NUS_EVT_RX_DATA:
			{
						uint8_t len = p_evt->params.rx_data.length;
						uint8_t buffer[len];
				

						// Copy data into buffer
						memcpy(buffer, p_evt->params.rx_data.p_data, len);
				
					NRF_LOG_INFO("BLE_NUS_EVT_RX_DATA: %X %X len: %d", buffer[0], buffer[1], len);
				
				
						// Reset all params to 0 to start with
						imu.gyro_enabled = 0;
						imu.accel_enabled = 0;
						imu.mag_enabled = 0;
						imu.quat6_enabled = 0;
						imu.quat9_enabled = 0;
						imu.euler_enabled = 0;
			
						for(uint8_t i=0; i<len; i++)
						{
							uint8_t temp = buffer[i];
							
							// Set struct parameters based on what configuration is set at central
							switch (temp)
							{
									case ENABLE_QUAT6:
										imu.quat6_enabled = 1;
										NRF_LOG_INFO("ENABLE_QUAT6 Received");
										break;

									case ENABLE_QUAT9:
										imu.quat9_enabled = 1;
										NRF_LOG_INFO("ENABLE_QUAT9 Received");
										break;
									
									case ENABLE_EULER:
										imu.euler_enabled = 1;
										NRF_LOG_INFO("ENABLE_EULER Received");
										break;
									
									case ENABLE_GYRO:
										imu.gyro_enabled = 1;
										NRF_LOG_INFO("ENABLE_GYRO Received");
										break;
									
									case ENABLE_ACCEL:
										imu.accel_enabled = 1;
										NRF_LOG_INFO("ENABLE_ACCEL Received");
										break;
									
									case ENABLE_MAG:
										imu.mag_enabled = 1;
										NRF_LOG_INFO("ENABLE_MAG Received");
										break;
									
									case STOP_IMU:
										imu.stop = 1;
										NRF_LOG_INFO("STOP_IMU Received");
										break;
									
									default:
										imu.gyro_enabled = 0;
										imu.accel_enabled = 0;
										imu.mag_enabled = 0;
										imu.quat6_enabled = 0;
										imu.quat9_enabled = 0;
										imu.euler_enabled = 0;
										NRF_LOG_INFO("Unknown Config Received");
										break;
							}
						}
						
						set_imu_packet_length();
						
