jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
// Bool to keep track if data over BLE NUS is send correctly
bool NUS_send_OK = true;

// CUSTOM
uint32_t nus_printf_custom(char* p_char)
{
		static uint16_t index;
		uint32_t err_code;
		static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
		while(*p_char != '\0'){
						data_array[index] = *p_char;
						index++;
						p_char++;
						}

		err_code = ble_nus_data_send(&m_nus, data_array, &index, m_conn_handle);
		
		// Check for errors
		if ((err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != NRF_ERROR_RESOURCES) &&
				(err_code != NRF_ERROR_NOT_FOUND))
		{
				APP_ERROR_CHECK(err_code);
		}
				
		index = 0;
		return err_code;
}

// CUSTOM
uint32_t nus_printf_custom_1(char* p_char)
{
	static uint16_t index;
	uint32_t err_code;
	static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
	while(*p_char != '\0'){
          data_array[index] = *p_char;
          index++;
          p_char++;
          }			
			do
			{
					err_code = ble_nus_data_send(&m_nus, data_array, &index, m_conn_handle);
					if ((err_code != NRF_ERROR_INVALID_STATE) &&
							(err_code != NRF_ERROR_RESOURCES) &&
							(err_code != NRF_ERROR_NOT_FOUND))
					{
							APP_ERROR_CHECK(err_code);
					}
			} while (err_code == NRF_SUCCESS);
		
			NRF_LOG_INFO("C:	%d", countrrr);
	countrrr++;
		index = 0;
	return err_code;
}

uint32_t nus_send(uint8_t * data, uint16_t len)
{
		uint32_t err_code;
	
		err_code = ble_nus_data_send(&m_nus, data, &len, m_conn_handle);
		
		// Check for errors
		if ((err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != NRF_ERROR_RESOURCES) &&
				(err_code != NRF_ERROR_NOT_FOUND))
		{
				APP_ERROR_CHECK(err_code);
		}
		return err_code;
}




// TimeSync
static void sync_timer_button_init(void)
{
    uint32_t       err_code;
    uint8_t        rf_address[5] = {0xDE, 0xAD, 0xBE, 0xEF, 0x19};
    ts_params_t    ts_params;
    
    // Debug pin: 
    // nRF52-DK (PCA10040) Toggle P0.24 from sync timer to allow pin measurement
    // nRF52840-DK (PCA10056) Toggle P1.14 from sync timer to allow pin measurement
#if defined(BOARD_PCA10040)
    nrf_gpiote_task_configure(3, NRF_GPIO_PIN_MAP(0, 24), NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    nrf_gpiote_task_enable(3);
#elif defined(BOARD_PCA10056)
    nrf_gpiote_task_configure(3, NRF_GPIO_PIN_MAP(1, 14), NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    nrf_gpiote_task_enable(3);
#else
#warning Debug pin not set
#endif
    
    nrf_ppi_channel_endpoint_setup(
        NRF_PPI_CHANNEL0, 
        (uint32_t) nrf_timer_event_address_get(NRF_TIMER3, NRF_TIMER_EVENT_COMPARE4),
        nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
    nrf_ppi_channel_enable(NRF_PPI_CHANNEL0);
    
    ts_params.high_freq_timer[0] = NRF_TIMER3;
    ts_params.high_freq_timer[1] = NRF_TIMER2;
    ts_params.rtc             = NRF_RTC1;
    ts_params.egu             = NRF_EGU3;
    ts_params.egu_irq_type    = SWI3_EGU3_IRQn;
    ts_params.ppi_chg         = 0;
    ts_params.ppi_chns[0]     = 1;
    ts_params.ppi_chns[1]     = 2;
    ts_params.ppi_chns[2]     = 3;
    ts_params.ppi_chns[3]     = 4;
    ts_params.rf_chn          = 125; /* For testing purposes */
    memcpy(ts_params.rf_addr, rf_address, sizeof(rf_address));
    
    err_code = ts_init(&ts_params);
    APP_ERROR_CHECK(err_code);
    
    err_code = ts_enable();
    APP_ERROR_CHECK(err_code);
    
    NRF_LOG_INFO("Started listening for beacons.\r\n");
    NRF_LOG_INFO("Press Button 1 to start sending sync beacons\r\n");
}


uint32_t usr_ble_init(void)
{
    bool erase_bonds;
    uint32_t err_code;

    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();

    ble_stack_init();
    gap_params_init();
    gatt_init();
    
    // Init NUS services and standard services
    services_init();

    NRF_LOG_DEBUG("DEBUG enabled in preprocessor");
    NRF_LOG_FLUSH();

    // Init TMS service
    err_code = usr_tms_init();
    APP_ERROR_CHECK(err_code);
    NRF_LOG_DEBUG("usr_tms_init done");

    err_code = usr_bas_init();
    APP_ERROR_CHECK(err_code);
    NRF_LOG_DEBUG("usr_bas_init done");

    advertising_init();
    NRF_LOG_DEBUG("advertising_init done");
    conn_params_init();
    NRF_LOG_DEBUG("conn_params_init done");

    // TimeSync
    sync_timer_button_init();
    NRF_LOG_DEBUG("sync_timer_button_init done");

    advertising_start();
    NRF_LOG_DEBUG("advertising_start done");

    return NRF_SUCCESS;
}


